Autodesk.Revit.DB.PlanViewRangeError
Describes errors in the location of planes in a PlanViewRange object.
Since:
2013

Autodesk.Revit.DB.PlanViewRangeError.ViewDepthBelowTopClip
View depth is below the top clip plane.

Autodesk.Revit.DB.PlanViewRangeError.ViewDepthAboveBottomClip
View depth is above the bottom clip plane.

Autodesk.Revit.DB.PlanViewRangeError.BottomClipAboveCutPlane
Bottom clip plane is above the cut plane.

Autodesk.Revit.DB.PlanViewRangeError.TopClipBelowCutPlane
Top clip plane is below the cut plane.